<?php

$string['pluginname'] = "Восстановленения пароля.";
$string['username'] = 'Имя пользователя:';
$string['criticalerror'] = 'Критическая ошибка! Неверный пароль.';
$string['passwordsdiffer'] = 'Пароли не совпадают друг с другом.';
$string['newpassword'] = 'Новый пароль:';
$string['required'] = 'Обязательное поле:';
$string['oldpassword'] = 'Текущий пароль:';
$string['again'] = 'Повторите:';
$string['invalidloginoremail'] = 'Неверное имя пользователя или адрес электронной почты.';
$string['errorpasswordreused'] = 'Этот пароль был    использован прежде, и не допускается к повторному использованию.';
$string['loginsite'] = 'Войдите на сайт.';
$string['errormatchpasswordandusername'] = 'Вы не можете использовать имя своей учетной записи в своем пароле.';
$string['errorminpassworddigits'] = 'Пароль должен состоять не менее из {$a} символов.';
$string['email'] = 'Адрес электронной почты:';
$string['usernameisnotundefined'] = 'Имя пользователя не является неопределенным.';
$string['errormatchpasswordandusername'] = 'Вы не можете использовать имя своей учетной записи в своем пароле.';
$string['errorminpasswordlength'] = 'Пароль должен состоять из не менее {$a} символов длины.';
$string['errormaxpasswordlength'] = 'Пароль должен состоять из не более {$a} символов длины.';
$string['errorminpasswordlower'] = 'Пароль должен состоять из не менее {$a} строчных символов.';
$string['errorminpasswordupper'] = 'Пароль должен состоять из не менее {$a} заглавных символов.';
$string['errorminpasswordnonalphanum'] = 'Пароль должен состоять из не менее {$a} не буквенно-цифровыx символов, таких как *, - или #.';
$string['errormaxconsecutiveidentchars'] = 'Пароль должен состоять из не более {$a} последовательных одинаковых символов.';
$string['emailpasswordconfirmmaybesent'] = '<p>Если вы указали правильное имя пользователя или адрес электронной почты, то вам должно было быть отправлено электронное письмо.</p>
 <p>Письмо содержит простые инструкции для подтверждения и завершения смены пароля.
Если вы по-прежнему испытываете трудности, пожалуйста, свяжитесь с администратором сайта.</p>';
$string['invalidpassword'] = 'Неверный пароль, пожалуйста, повторите попытку.';